const express = require('express');
const app = express();
const PORT = process.env.PORT || 8080;
const path = require('path');
__dirname = path.resolve();

var mainListArray = [{
    "לסגור אולם": [
        " לסגור עם DJ / נגנים",
        "להחליט ולתכנן עיצוב אולם",
        "לסגור עם מעצב אולם",
        "לעשות סידורי ישיבה",
        "להכין רשימת אורחים סופית עם טלפונים ושמות מלאים לתיאום הגעה",
        "לסגור צלם + מגנטים",
        "להכין פלייליסט לחתונה",
        "להכין רשימת אביזרים אקסטרה לאולם",
        "לארגן מתנות לאורחים",
        "טעימות ובניית תפריט",
        "סגירת סידור עם האולם",
        "לתאם הסעות לאולם"
    ]
}, {
    "להמציא מסמכים לפתיחת תיק רבנות": [
        " לפתוח תיק ברבנות",
        "לסגור עם רב",
        "לתאם הדרכות חתן וכלה",
        "לסיים הדרכות חתן וכלה",
        "לתאם מקווה",
        "להזמין כתובה",
    ]
}, {
    "להכין SAVE THE DATE": [
        " לשלוח SAVE THE DATE",
        "לעצב הזמנות",
        "להדפיס הזמנות",
        "לחלק ולשלוח הזמנות",
        "להזמין טבעות נישואין",
        "לתאם רכב + נהג לחתונה",
        "לדאוג לקישוט רכב",
    ]
}, {
    "לסגור עם מאפרת+שיער": [
        " לעשות סיור שמלות",
        "להחליט על עיצוב שמלה",
        "למצוא ולתאם עם תופרת",
        "לקנות חליפת חתן",
        "לארגן אביזרים לשושבינות",
        "לבחור שושבינות",
        "לתאם מסיבות רווקים רווקות",
        "לארגן מסיבת אירוסין",
        "להסוף שמלה + נעליים",
        "לעשות קנייה מרוכזת לאביזרים תכשיטים",
        "להזמין/לקנות זר כלה לחתונה",
    ]
}]

// Use the built-in JSON body parser middleware
app.use(express.json());

app.use(express.static(path.join(__dirname, 'public')))

app.get("/getArray", (req, res) => {
    res.send(JSON.stringify(mainListArray))
})

app.post("/update", (req, res) => {
    mainListArray = req.body;
    
})

app.listen(PORT, () => {
    console.log('app is running on port: ' + PORT);
});



